# ViewSolarstudyShadowsIntensityValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyShadowsIntensityValue Property
ParameterTypeId Class See Also
---
"Shadows intensity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyShadowsIntensityValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyShadowsIntensityValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyShadowsIntensityValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace